{
    "courseId": "gams-in-r-course",
    "title": "General Aditive Models in R",
    "slogan": "A free online course",
    "description": "Hello, and welcome to Nonlinear Modeling in R with GAMs. Whenever we build statistical models, we face a trade-off between flexibility and interpretability. Generalized additive models, or GAMs, offer a middle ground between simple models, such as those we fit with linear regression, and more complex machine learning models like neural networks. GAMs can be fit to complex, nonlinear relationships and make good predictions in these cases, but we are still able to do inferential statistics and understand and explain the underlying structure of our models and why they make predictions that they do.In this course, you will learn the fundamentals of how GAMs work and how to use the mgcv package in R to model your data. You will inspect, diagnose, and visualize your models so that you can interpret your data and communicate your results with others. You’ll also build classification models, making predictions with GAM classifiers and explaining and interpreting what drives those predictions.",
    "bio": "My name is Noam Ross. I'm a scientist that studies infectious disease, and I use R and data science to understand complex systems. I am a graduate student in the UC Davis Graduate Group in Ecology, where I study methods of ecological forecasting. At Davis I am part of the Hastings Lab, the IGERT in Responding to Rapid Environmental Change, and the Forest Biology Research Center.",
    "siteUrl": "https://course-starter-r.netlify.com",
    "twitter": "spacy_io",
    "fonts": "IBM+Plex+Mono:500|IBM+Plex+Sans:700|Lato:400,400i,700,700i",
    "testTemplate": "success <- function(text) {\n    cat(paste(\"\\033[32m\", text, \"\\033[0m\", sep = \"\"))\n}\n\n.solution <- \"${solutionEscaped}\"\n\n${solution}\n\n${test}\ntryCatch({\n    test()\n}, error = function(e) {\n    cat(paste(\"\\033[31m\", e[1], \"\\033[0m\", sep = \"\"))\n})",
    "juniper": {
        "repo": "flor14/course_GAM_in_R",
        "branch": "binder",
        "lang": "r",
        "kernelType": "ir",
        "debug": false
    },
    "showProfileImage": true,
    "footerLinks": [
        { "text": "Website", "url": "http://www.noamross.net" },
        { "text": "Source", "url": "https://github.com/ines/course-starter-r" },
        { "text": "Built with ♥", "url": "https://github.com/ines/course-starter-r" }
    ],
    "theme": "#de7878"
}
