{"data":{"site":{"siteMetadata":{"title":"Generalized Additive Models in R"}},"allMarkdownRemark":{"edges":[{"node":{"fields":{"slug":"/chapter1"},"frontmatter":{"title":"1 - Introduction to Generalized Additive Models","description":"In this chapter, you will learn how Generalized additive models work and how to use flexible, nonlinear functions to model data without over-fitting. You will learn to use the gam() function in the mgcv package, and how to build multivariate models that mix nonlinear, linear, and categorical effects to data."}}},{"node":{"fields":{"slug":"/chapter2"},"frontmatter":{"title":"2 - Interpreting and Visualizing GAMs","description":"In this chapter, you will take a closer look at the models you fit in chapter 1 and learn how to interpret and explain them.  You will learn how to make plots that show how different variables affect model outcomes.  Then you will diagnose problems in models arising from under-fitting the data or hidden relationships between variables, and how to iteratively fix those problems and get better results."}}},{"node":{"fields":{"slug":"/chapter3"},"frontmatter":{"title":"3 - Spatial GAMs and Interactions","description":"In this chapter, you will extend the types of models you can fit to those with interactions of multiple variables.  You will fit models of geospatial data by using these interactions to model complex surfaces, and visualize those surfaces in 3D.  Then you will learn about interactions between smooth and categorical variables, and how to model interactions between very different variables like space and time."}}},{"node":{"fields":{"slug":"/chapter4"},"frontmatter":{"title":"4 - Logistic GAMs for Classification","description":"In the first three chapters, you used GAMs for regression of continuous outcomes.  In this chapter, you will use GAMs for classification. You will build logistic GAMs to predict binary outcomes like customer purchasing behavior, learn to visualize this new type of model, make predictions, and learn how to explain the variables that influence each prediction."}}},{"node":{"fields":{"slug":"/chapter5"},"frontmatter":{"title":"Reference and Resources","description":"Here are scripts to re-use and links to additional references and topics to learn."}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}